lib/soap-templates/AddRecruiterV2.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:job="http://jobboard.webservice.madgex.co.uk">
   <soapenv:Header/>
   <soapenv:Body>
      <job:AddRecruiterV2>
         <job:data>
            <!--Optional:-->
            <job:RecruiterName>?</job:RecruiterName>
            <!--Optional:-->
            <job:CustomerBillingID>?</job:CustomerBillingID>
            <!--Optional:-->
            <job:ContactFirstName>?</job:ContactFirstName>
            <!--Optional:-->
            <job:ContactLastName>?</job:ContactLastName>
            <!--Optional:-->
            <job:ContactLastName2>?</job:ContactLastName2>
            <!--Optional:-->
            <job:Address1>?</job:Address1>
            <!--Optional:-->
            <job:Address2>?</job:Address2>
            <!--Optional:-->
            <job:Address3>?</job:Address3>
            <!--Optional:-->
            <job:TownCity>?</job:TownCity>
            <!--Optional:-->
            <job:CountyState>?</job:CountyState>
            <!--Optional:-->
            <job:ZipPostCode>?</job:ZipPostCode>
            <!--Optional:-->
            <job:Country>?</job:Country>
            <!--Optional:-->
            <job:Telephone>?</job:Telephone>
            <!--Optional:-->
            <job:ContactEmail>?</job:ContactEmail>
            <job:RecruiterTypeID>?</job:RecruiterTypeID>
            <!--Optional:-->
            <job:Image>
               <!--Optional:-->
               <job:AssetID>?</job:AssetID>
               <!--Optional:-->
               <job:Base64BlobString>?</job:Base64BlobString>
            </job:Image>
            <!--Optional:-->
            <job:EnhancedJobHtml>
               <!--Optional:-->
               <job:JobTitleTextCss>?</job:JobTitleTextCss>
               <!--Optional:-->
               <job:JobHeadingsTextCss>?</job:JobHeadingsTextCss>
               <!--Optional:-->
               <job:ButtonBackgroundCss>?</job:ButtonBackgroundCss>
               <!--Optional:-->
               <job:ButtonTextCss>?</job:ButtonTextCss>
               <!--Optional:-->
               <job:HyperLinkCss>?</job:HyperLinkCss>
               <!--Optional:-->
               <job:Banner>
                  <!--Optional:-->
                  <job:AssetID>?</job:AssetID>
                  <!--Optional:-->
                  <job:Base64BlobString>?</job:Base64BlobString>
               </job:Banner>
            </job:EnhancedJobHtml>
            <!--Optional:-->
            <job:AccountManager>
               <!--Optional:-->
               <job:EmailAddress>?</job:EmailAddress>
               <!--Optional:-->
               <job:FirstName>?</job:FirstName>
               <!--Optional:-->
               <job:LastName>?</job:LastName>
            </job:AccountManager>
            <job:CanAccessCvDatabase>?</job:CanAccessCvDatabase>
         </job:data>
      </job:AddRecruiterV2>
   </soapenv:Body>
</soapenv:Envelope>